Repository: Klipper3d/klipper
Catalog: docs/locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: nb_no

source: This document describes the method for calibrating the x, y, and z offsets of an "automatic z probe" in Klipper. This is useful for users that have a `[probe]` or `[bltouch]` section in their config file.
nb_no: Dette dokumentet beskriver metoden for kalibrering av x, y, og z-forskyvning av en «automatisk probe» i Klipper. Dette er nyttig for brukere som har en «[probe]» eller «[bltouch]»-del i oppsettsfilen sin.

source: Calibrating probe X and Y offsets
nb_no: Kalibrering av probeforskyvning for X og Y

source: Place a piece of blue painters tape (or similar) on the bed underneath the probe. Navigate to the OctoPrint "Terminal" tab and issue a PROBE command:
nb_no: Plasser en bit blå maskeringstape (eller lignende) på bunnplaten under proben. Gå til «Terminal»-fanen i OctoPrint og utfør en «PROBE»-kommando:

source: Place a mark on the tape directly under where the probe is (or use a similar method to note the location on the bed).
nb_no: Merk tapen akkurat under proben (eller bruk en lignende metode for å merke posisjon på bunnplaten).

source: Issue a `GET_POSITION` command and record the toolhead XY location reported by that command. For example if one sees:
nb_no: Utfør en «GET_POSITION»-kommando og ta vare på verktøyhodets XY-posisjon, som rapportert av kommandoen. For eksempel hvis man ser:

source: then one would record a probe X position of 46.5 and probe Y position of 27.
nb_no: vil man registrere en X-probeposisjon på 46,5 og en Y-probeposisjon på 27.

source: After recording the probe position, issue a series of G1 commands until the nozzle is directly above the mark on the bed. For example, one might issue:
nb_no: Etter å ha registrert probeposisjon, send en rekke G1-kommandoer til tuten er direkte over merket på bunnplaten. For eksempel kan man utføre:

source: to move the nozzle to an X position of 57 and Y of 30. Once one finds the position directly above the mark, use the `GET_POSITION` command to report that position. This is the nozzle position.
nb_no: for å flytte tuten til en X-posisjon på 57, og Y-posisjon på 30. Når man finner posisjonen direkte over merket, kan man bruke «GET_POSITION»-kommandoen for å rapportere den posisjonen. Dette er tut-posisjonen.

source: The x_offset is then the `nozzle_x_position - probe_x_position` and y_offset is similarly the `nozzle_y_position - probe_y_position`. Update the printer.cfg file with the given values, remove the tape/marks from the bed, and then issue a `RESTART` command so that the new values take effect.
nb_no: «x_offset» er dermed «nozzle_x_position - probe_x_position» og «y_offset» er «nozzle_y_position - probe_y_position». Oppdater printer.cfg-filen med angitte verdier, fjern tape/merker fra bunnplaten, og kjør så en «RESTART»-kommando slik at de nye endringene anvendes.

source: Calibrating probe Z offset
nb_no: Kalibrering av probeforskyvning for Z

source: Providing an accurate probe z_offset is critical to obtaining high quality prints. The z_offset is the distance between the nozzle and bed when the probe triggers. The Klipper `PROBE_CALIBRATE` tool can be used to obtain this value - it will run an automatic probe to measure the probe's Z trigger position and then start a manual probe to obtain the nozzle Z height. The probe z_offset will then be calculated from these measurements.
nb_no: Å angi nøyaktig z_offset for proben er kritisk for nøyaktige utskrifter. z_offset er avstanden mellom tuten og bunnplaten når proben utløser. Klipper sitt «PROBE_CALIBRATE»-verktøy kan brukes til å hente denne verdien. Den vil kjøre en automatisk probe for å måle probens Z-utløserposisjon og så starte en manuell probe for å hente Z-høyde for tuten. Probens z_offset vil så bli regnet ut basert på disse målingene.

source: This tool will perform an automatic probe, then lift the head, move the nozzle over the location of the probe point, and start the manual probe tool. If the nozzle does not move to a position above the automatic probe point, then `ABORT` the manual probe tool and perform the XY probe offset calibration described above.
nb_no: Verktøyet vil utføre en automatisk probe, løfte hodet, flytte tuten over stedet for probingspunkt, og starte det manuelle probeverktøyet. Hvis tuten ikke flytter til en posisjon over det automatiske probepunktet, vil «ABORT» avslutte det manuelle probeverktøyet og utføre kalibrering av XY-probeforskyvning beskrevet ovenfor.

source: Note that if a change is made to the printer's motion system, hotend position, or probe location then it will invalidate the results of PROBE_CALIBRATE.
nb_no: Merk at hvis endringen gjøres for skriverens bevegegelsessystem, varmepunktsposisjon, eller probeposisjonen, vil den invalidere resultatet av «PROBE_CALIBRATE».

source: This command will run the probe ten times and produce output similar to the following:
nb_no: Denne kommandoen vil kjøre proben ti ganger og gi et resultat lignende følgende:

source: If the results of the test show a range value that is greater than 25 microns (.025mm) then the probe does not have sufficient accuracy for typical bed leveling procedures. It may be possible to tune the probe speed and/or probe start height to improve the repeatability of the probe. The `PROBE_ACCURACY` command allows one to run tests with different parameters to see their impact - see the [G-Codes document](G-Codes.md) for further details. If the probe generally obtains repeatable results but has an occasional outlier, then it may be possible to account for that by using multiple samples on each probe - read the description of the probe `samples` config parameters in the [config reference](Config_Reference.md#probe) for more details.
nb_no: Hvis resultatet av testen viser en spennviddeverdi høyere en 25 mikrometer «0,025 mm) vil proben ikke ha nok nøyaktighet for typiske bunnplateniveleringsprosedyrer. Det kan være mulig å justere probehastighet og/eller probestarthøyde for å forbedre gjentagbarheten for proben. «PROBE_ACCURACY»-kommandoen lar deg kjøre tester med forskjellige parameter for å se deres innvirkning. Sjekk «[G-kodedokumentet](G-Codes.md)» for flere detaljer. Hvis proben generelt innhenter reproduserbare resultater, men har et sjeldent avvik nå og da, kan det være mulig å ta høyde for dette ved å bruke flere samplinger for hver probe. Les beskrivelsen av probens «sample»-oppsettsparameter i «[oppsettsreferansen](Config_Reference.md#probe)» for flere detaljer.

source: If new probe speed, samples count, or other settings are needed, then update the printer.cfg file and issue a `RESTART` command. If so, it is a good idea to [calibrate the z_offset](#calibrating-probe-z-offset) again. If repeatable results can not be obtained then don't use the probe for bed leveling. Klipper has several manual probing tools that can be used instead - see the [Bed Level document](Bed_Level.md) for further details.
nb_no: Hvis probehastighet, samplingsantall, eller andre innstillinger trengs, kan du oppdatere skriverens printer.cfg-fil og kjøre «RESTART»-kommandoen. Hvis dette gjøres er det en god idé å også [kalibrere z_offset](#calibrating-probe-z-offset) igjen. Hvis reproduserbare resultater ikke kan demonstreres, så bruker du ikke proben for bunnplatenivelering. Klipper har flere manuelle probeverktøy som kan brukes istedenfor. Sjekk «[Bunnplatenivådokumentet](Bed_Level.md)» for flere detaljer.

source: Location Bias Check
nb_no: Posisjonsbiassjekk

source: Some probes can have a systemic bias that corrupts the results of the probe at certain toolhead locations. For example, if the probe mount tilts slightly when moving along the Y axis then it could result in the probe reporting biased results at different Y positions.
nb_no: Noen prober kan ha et systemisk bias som forringer resultatet for en probe for gitte verktøyhodeposisjoner. For eksempel, hvis proben er litt skjev når den flytter seg langs Y-aksen, kan dette gi høyere rapportert hastighet på forskjellige Y-posisjoner.

source: This is a common issue with probes on delta printers, however it can occur on all printers.
nb_no: Dette er et vanlig problem med proner på delta-skribere, dog kan det inntreffe på alle skrivere.

source: One can check for a location bias by using the `PROBE_CALIBRATE` command to measuring the probe z_offset at various X and Y locations. Ideally, the probe z_offset would be a constant value at every printer location.
nb_no: Man kan se etter posisjonsbias ved å bruke «PROBE_CALIBRATE»-kommendoen for å måle probens z_offset ved forskjellige X- og Y-posisjoner. Ideelt vil probens z_offset være en kosntant verdi for hver skriverposisjon.

source: Before starting this test, first calibrate the probe X, Y, and Z offsets as described at the beginning of this document. Then home the printer and navigate to the first XY position. Follow the steps at [calibrating probe Z offset](#calibrating-probe-z-offset) to run the `PROBE_CALIBRATE` command, `TESTZ` commands, and `ACCEPT` command, but do not run `SAVE_CONFIG`. Note the reported z_offset found. Then navigate to the other XY positions, repeat these `PROBE_CALIBRATE` steps, and note the reported z_offset.
nb_no: Før du starter testen, kalibrerer du først probens X, Y og Z-forskyvning som angitt i begynnelsen av dette dokumentet. Deretter nullstiller du skriveren og navigerer til første XY-posisjon. Følg stegene i [kalibrering av probeforskyvning for Z](#calibrating-probe-z-offset) og kjør «PROBE_CALIBRATE»-kommandoen, «TESTZ»-kommandoene, og «ACCEPT»-kommandoen, uten å kjøre «SAVE_CONFIG». Registrer rapportert z_offset. Gå så til de andre XY-posisjonene, gjenta disse «PROBE_CALIBRATE»-stegene, og registrer rapportert z_offset.

source: Temperature Bias
nb_no: Temperaturbias

source: Many probes have a systemic bias when probing at different temperatures. For example, the probe may consistently trigger at a lower height when the probe is at a higher temperature.
nb_no: Mange prober har et systemisk bias der probing under forskjellige temperaturer. For eksempel kan proben alltid utløse ved en lavere høyde når den er i høyere temperatur.

source: It is recommended to run the bed leveling tools at a consistent temperature to account for this bias. For example, either always run the tools when the printer is at room temperature, or always run the tools after the printer has obtained a consistent print temperature. In either case, it is a good idea to wait several minutes after the desired temperature is reached, so that the printer apparatus is consistently at the desired temperature.
nb_no: Det anbefales å kjøre bunnplateniveleringsverktøyene i gjevn temperatur for å ta høyde for biaset. For eksempel kan du alltid kjøre verktøyene når skriveren er i romtemperatur, eller alltid kjøre verktøyene etter at skriveren har nådd driftstemperatur. Uansett er det en god idé å vente flere minutter etter at ønsket temperatur er nådd, slik at apparatet fungerer som det skal ved ønsket temperatur.

source: To check for a temperature bias, start with the printer at room temperature and then home the printer, move the head to a position near the center of the bed, and run the `PROBE_ACCURACY` command. Note the results. Then, without homing or disabling the stepper motors, heat the printer nozzle and bed to printing temperature, and run the `PROBE_ACCURACY` command again. Ideally, the command will report identical results. As above, if the probe does have a temperature bias then be careful to always use the probe at a consistent temperature.
nb_no: For å sjekke temperaturbias, start med skriveren i romtemperatur og nullstill skriveren, flytt hodet til et sted nær midten av bunnplaten, og kjør «PROBE_ACCURACY»-kommandoen. Registrer resultatet. Deretter varmer du opp skrivertuten og bunnplaten til skrivetemperatur, og kjører «PROBE_ACCURACY» (uten å nullstille eller skru av stepper-motorene). Ideelt vil kommandoen gi identiske resultater. Som ovenfor, er det nødvendig å være oppmerksom på at hvis proben har et temperaturbias, vil det være bedre å alltid bruke den ved gjevn temperatur.
